In [1]:
import pandas as pd

# Корабли

Корабли в «классах» построены по одному и тому же проекту, и классу присваивается либо имя первого корабля, построенного по данному проекту, либо названию класса дается имя проекта, которое не совпадает ни с одним из кораблей в БД. Корабль, давший название классу, называется головным.
Отношение Classes содержит имя класса, тип (bb для боевого (линейного) корабля или bc для боевого крейсера), страну, в которой построен корабль, число главных орудий, калибр орудий (диаметр ствола орудия в дюймах) и водоизмещение ( вес в тоннах). В отношении Ships записаны название корабля, имя его класса и год спуска на воду. В отношение Battles включены название и дата битвы, в которой участвовали корабли, а в отношении Outcomes – результат участия данного корабля в битве (потоплен-sunk, поврежден - damaged или невредим - OK).
Замечания. 1) В отношение Outcomes могут входить корабли, отсутствующие в отношении Ships. 2) Потопленный корабль в последующих битвах участия не принимает.

![](images/ships.png)

In [3]:
classes = pd.read_csv('data/classes.csv', index_col='class')
classes.head()

               type     country  guns  bore  displacement
class
Bismarck         bb     Germany     8  15.0         42000
Iowa             bb         USA     9  16.0         46000
Kongo            bc       Japan     8  14.0         32000
North Carolina   bb         USA    12  16.0         37000
Renown           bc  Gt.Britain     6  15.0         32000

In [4]:
ships = pd.read_csv('data/ships.csv', index_col='name')
ships.head()

                class  launched
name
California  Tennessee      1921
Haruna          Kongo      1916
Hiei            Kongo      1914
Iowa             Iowa      1943
Kirishima       Kongo      1915

In [5]:
outcomes = pd.read_csv('data/outcomes.csv', index_col=['ship', 'battle'])
outcomes.head()

                            result
ship         battle
Bismarck     North Atlantic   sunk
California   Surigao Strait     OK
Duke of York North Cape         OK
Fuso         Surigao Strait   sunk
Hood         North Atlantic   sunk

In [6]:
battles = pd.read_csv('data/battles.csv', index_col='name')
battles.head()

                               date
name
Guadalcanal     1942-11-15 00:00:00
North Atlantic  1941-05-25 00:00:00
North Cape      1943-12-26 00:00:00
Surigao Strait  1944-10-25 00:00:00

# Задача 1.

Найдите страны, имевшие когда-либо классы обычных боевых кораблей ('bb') и имевшие когда-либо классы крейсеров ('bc').

![](images/ships.png)

### Pandas

In [7]:
# Воспользуйтесь командами groupby и nunique
# Попробуйте решить задачу без использования merge и без дополнительных переменных
# Разрешается отдельно не выделять True страны

# your code here

# Задача 2.

Для каждого класса определите год, когда был спущен на воду первый корабль этого из класса.
![](images/ships.png)

### Pandas

In [8]:
# Воспользуйтесь merge, groupby, min
# Попробуйте решить задачу одной командой без введения дополнительных переменных

# your code here

# Самолёты

Таблица company содержит идентификатор и название компании, осуществляющей перевозку пассажиров. Таблица trip содержит информацию о рейсах: номер рейса, идентификатор компании, тип самолета, город отправления, город прибытия, время отправления и время прибытия. Таблица passenger содержит идентификатор и имя пассажира. Таблица pass_in_trip содержит информацию о полетах: номер рейса, дата вылета (день), идентификатор пассажира и место, на котором он сидел во время полета.


![](images/planes.png)

In [9]:
trip = pd.read_csv('data/trip.csv', index_col='trip_no',
    parse_dates=['time_out', 'time_in'], infer_datetime_format=True)
trip.head()

,id_comp,plane,town_from,town_to,time_out,time_in
trip_no,,,,,,
1100,4,Boeing,Rostov,Paris,1900-01-01 14:30:00,1900-01-01 17:50:00
1101,4,Boeing,Paris,Rostov,1900-01-01 08:12:00,1900-01-01 11:45:00
1123,3,TU-154,Rostov,Vladivostok,1900-01-01 16:20:00,1900-01-02 03:40:00
1124,3,TU-154,Vladivostok,Rostov,1900-01-01 09:00:00,1900-01-01 19:50:00
1145,2,IL-86,Moscow,Rostov,1900-01-01 09:35:00,1900-01-01 11:23:00

In [10]:
pass_in_trip = pd.read_csv('data/pass_in_trip.csv',
    infer_datetime_format=True, parse_dates=['date'])
pass_in_trip.head()

   trip_no       date  id_psg       place
0     1100 2003-04-29       1  1a
1     1123 2003-04-05       3  2a
2     1123 2003-04-08       1  4c
3     1123 2003-04-08       6  4b
4     1124 2003-04-02       2  2d

In [11]:
company = pd.read_csv('data/company.csv', index_col='id_comp')
company.head()

               name
id_comp
1        Don_avia
2        Aeroflot
3        Dale_avia
4        air_France
5        British_AW

In [12]:
passenger = pd.read_csv('data/passenger.csv', index_col='id_psg')
passenger.head()

                        name
id_psg
1       Bruce Willis
2       George Clooney
3       Kevin Costner
4       Donald Sutherland
5       Jennifer Lopez

# Задача 3.

Определить имена пассажиров, когда-либо летевших на одном и том же месте более одного раза. 

![](images/planes.png)

### Pandas

In [17]:
# Попробуйте решить одной командой используя один merge и два groupby, функции count и sum

# your code here

# Задача 4.

Для каждой авиакомпании определить:

* количество выполненных перелетов;
* число использованных типов самолетов;
* количество перевезенных различных пассажиров;
* общее число перевезенных компанией пассажиров. 

![](images/planes.png)

### Pandas

In [14]:
# Попробуйте решить одной командой используя nunique

# your code here

# Задача 5.
Найти количество маршрутов, которые обслуживаются наибольшим числом рейсов.
Замечания.
* A - B и B - A считать разными маршрутами.
* Использовать только таблицу Trip 
![](images/planes.png)

### Pandas

In [18]:
# Решить одной командой
# Не допускается ипользование merge и дополнительных переменных

# your code here

# Задача 6.
Определить номера пассажиров, которые больше других времени провели в полетах.
Вывести имена и общее время в минутах, проведенное в полетах

![](images/planes.png)

### Pandas

In [16]:
# Здесь расматриваются типы времени: изначально timestamp, и после взятия разности -- timediff.
# Обращение к методам времени осуществляется через поле series.dt

# your code here